{
  "SchemaStore.nvim": { "branch": "main" },
  "alpha": { "branch": "main" },
  "auto-dark-mode.nvim": { "branch": "master" },
  "autopairs": { "branch": "master" },
  "barbar": { "branch": "master" },
  "bigfile.nvim": { "branch": "main" },
  "cmp": { "branch": "main" },
  "cmp-async-path": { "branch": "main" },
  "cmp-buffer": { "branch": "main" },
  "cmp-calc": { "branch": "main" },
  "cmp-cmdline": { "branch": "main" },
  "cmp-emoji": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp-zsh": { "branch": "main" },
  "cmp_luasnip": { "branch": "master" },
  "comment": { "branch": "master" },
  "conform": { "branch": "master" },
  "crates": { "branch": "main" },
  "dap": { "branch": "master" },
  "dapui": { "branch": "master" },
  "dbee": { "branch": "master" },
  "devicons": { "branch": "master" },
  "diffview.nvim": { "branch": "main" },
  "flutter-tools": { "branch": "main" },
  "friendly-snippets": { "branch": "main" },
  "gitsigns.nvim": { "branch": "main" },
  "hare-jump.vim": { "branch": "main" },
  "haskell-tools": { "branch": "master" },
  "hotpot.nvim": { "branch": "main" },
  "indent-blankline.nvim": { "branch": "master" },
  "jdtls": { "branch": "master" },
  "jinja.vim": { "branch": "master" },
  "jira.nvim": { "branch": "main" },
  "json5": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lint": { "branch": "master" },
  "lsp-inlayhints.nvim": { "branch": "main" },
  "lualine": { "branch": "master" },
  "luapad": { "branch": "master" },
  "luasnip": { "branch": "master" },
  "markdown-preview.nvim": { "branch": "master" },
  "mason.nvim": { "branch": "main" },
  "neodev.nvim": { "branch": "main" },
  "neogit": { "branch": "master" },
  "nlsp-settings.nvim": { "branch": "main" },
  "noice": { "branch": "main" },
  "notify": { "branch": "master" },
  "nui": { "branch": "main" },
  "nvim-colorizer.lua": { "branch": "master" },
  "nvim-lsp-endhints": { "branch": "main" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-nio": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-ts-autotag": { "branch": "main" },
  "nvim-ts-context-commentstring": { "branch": "main" },
  "osc52": { "branch": "main" },
  "overseer.nvim": { "branch": "master" },
  "paperplanes.nvim": { "branch": "master" },
  "paredit": { "branch": "master" },
  "plenary": { "branch": "master" },
  "project.nvim": { "branch": "main" },
  "rustaceanvim": { "branch": "master" },
  "screenkey.nvim": { "branch": "main" },
  "surround": { "branch": "main" },
  "telescope": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope-ui-select.nvim": { "branch": "master" },
  "todo-comments.nvim": { "branch": "main" },
  "toggleterm.nvim": { "branch": "main" },
  "tree": { "branch": "master" },
  "treesitter": { "branch": "master" },
  "typescript-tools": { "branch": "master" },
  "vim-blade": { "branch": "master" },
  "vim-illuminate": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "vim-rfc": { "branch": "master" },
  "which-key.nvim": { "branch": "main" },
  "windsurf.vim": { "branch": "main" },
  "zen-mode.nvim": { "branch": "main" }
}
