{
  "SchemaStore.nvim": { "branch": "main" },
  "alpha": { "branch": "main" },
  "barbar": { "branch": "master" },
  "bigfile.nvim": { "branch": "main" },
  "cmp": { "branch": "main" },
  "cmp-async-path": { "branch": "main" },
  "cmp-buffer": { "branch": "main" },
  "cmp-calc": { "branch": "main" },
  "cmp-emoji": { "branch": "main" },
  "cmp-nvim-lsp": { "branch": "main" },
  "cmp_luasnip": { "branch": "master" },
  "comment": { "branch": "master" },
  "conform": { "branch": "master" },
  "crates.nvim": { "branch": "main" },
  "dap": { "branch": "master" },
  "devicons": { "branch": "master" },
  "dressing.nvim": { "branch": "master" },
  "fidget": { "branch": "legacy" },
  "flutter-tools": { "branch": "main" },
  "friendly-snippets": { "branch": "main" },
  "gitsigns.nvim": { "branch": "main" },
  "haskell-tools": { "branch": "master" },
  "hotpot.nvim": { "branch": "master" },
  "indent-blankline.nvim": { "branch": "master" },
  "jdtls": { "branch": "master" },
  "lazy.nvim": { "branch": "main" },
  "lint": { "branch": "master" },
  "lsp-inlayhints.nvim": { "branch": "main" },
  "lsp-signature": { "branch": "master" },
  "lualine": { "branch": "master" },
  "luapad": { "branch": "master" },
  "luasnip": { "branch": "master" },
  "mason.nvim": { "branch": "main" },
  "neodev.nvim": { "branch": "main" },
  "nlsp-settings.nvim": { "branch": "main" },
  "notify": { "branch": "master" },
  "nvim-autopairs": { "branch": "master" },
  "nvim-colorizer.lua": { "branch": "master" },
  "nvim-lspconfig": { "branch": "master" },
  "nvim-notify": { "branch": "master" },
  "nvim-treesitter-textobjects": { "branch": "master" },
  "nvim-ts-autotag": { "branch": "main" },
  "nvim-ts-context-commentstring": { "branch": "main" },
  "osc52": { "branch": "main" },
  "paperplanes.nvim": { "branch": "master" },
  "playground": { "branch": "master" },
  "plenary.nvim": { "branch": "master" },
  "project.nvim": { "branch": "main" },
  "rust-tools": { "branch": "master" },
  "surround": { "branch": "main" },
  "telescope": { "branch": "master" },
  "telescope-fzf-native.nvim": { "branch": "main" },
  "telescope-ui-select.nvim": { "branch": "master" },
  "todo-comments.nvim": { "branch": "main" },
  "toggleterm.nvim": { "branch": "main" },
  "tree": { "branch": "master" },
  "treesitter": { "branch": "master" },
  "typescript-tools": { "branch": "master" },
  "vim-blade": { "branch": "master" },
  "vim-illuminate": { "branch": "master" },
  "vim-instant-markdown": { "branch": "master" },
  "vim-repeat": { "branch": "master" },
  "which-key.nvim": { "branch": "main" },
  "zen-mode.nvim": { "branch": "main" }
}